const content = [
  { 
    riddle: `Пёстрый хоровод ребят<br>
Через каждый год летят<br>
Кто из них верхом на вьюге<br>
Замыкает этот ряд?`,
    answer: `декабрь`,
    prize: `Да! И пусть он будет снежный<br>
И не злой, и очень нежный<br>
Пусть несёт благие вести<br>
А не то что этот, прежний`,
  },
  { 
    riddle: `Можно сделать на удачу<br>
Мой шарообразный пуз<br>
Это я весною плачу<br>
А зимой всегда смеюсь`,
    answer: `снеговик`,
    prize: `Вместо носика - морковка<br>
Пара веток вместо рук<br>
Скатан я из снега ловко<br>
Обнимашками делюсь!`,
  },
  { 
    riddle: `Я зимой стою в лесу, издали видна<br>
Шубою пушистою вся окружена<br>
Если хочешь праздничный подарить настрой<br>
Будь со мною вежлив и забери домой`,
    answer: `елка`,
    prize: `Яркую гирлянду на меня надень<br>
Блеск игрушек праздничных наполнит этот день<br>
Пусть возьмётся за руки, песню запоёт<br>
Пусть идёт вокруг меня, кружит хоровод!`,
  },
  { 
    riddle: `Бубенчики звенят, несутся лесом кони<br>
Они спешат к тебе доставить очень важный груз<br>
Как только выйду из саней - праздник к нам приходит<br>
А ну, скажите дети - как меня зовут?`,
    answer: `дед мороз`,
    prize: `Я принёс вам волшебство! Это знает всякий -<br>
Новый год в себе таит красок карнавал<br>
Дед Мороз приносит детям радость и подарки<br>
Но лишь тем, кто добрым был и маме помогал`,
  },
  { 
    riddle: `Я белый, я пушистый, я бываю<br>
Во всех углах и куче разных мест<br>
Я землю покрывалом покрываю<br>
Почти всегда! Но только летом нет`,
    answer: `снег`,
    prize: `Я белая перина! Я мягкая постель!<br>
Я горная лавина! Я лёгкий снегопад!<br>
Хрустящие следы - ноты моей песни<br>
И искры от луны на мне горят.`,
  },
  { 
    riddle: `Я был рождён идеей, что как искра сияла<br>
Я был сокрытый тайной и замыслом храним<br>
Ты под покровом ночи мой образ собирала<br>
Чтобы в один прекрасный миг ему меня вручить`,
    answer: `подарок`,
    prize: `Пусть только блеск в его глазах моею был наградой<br>
Ведь всё равно, каким я был, и во что одет<br>
Поскольку главное - любовь, с которой создавался<br>
Любовь, которую дашь в дар и обретёшь в ответ`,
  },
  { 
    riddle: `Вино налито по бокалам, нарезаны салаты<br>
Скоро будет бой часов, накрытый стол зовёт<br>
Все мы верим - эта ночь на чудеса богата<br>
Все мечты исполнит праздник input`,
    answer: `новый год`,
    prize: `На двенадцатый удар тосты зазвучали<br>
Пепел заклинаний поглощён в устах<br>
Каждое желание звёзды записали<br>
На бумаге нового чистого листа`,
  },
  { 
    riddle: `Этот звук предвестником выступает чуда<br>
Вызывает этот звук радость у ребят<br>
Празднует честной народ, бахает салюты<br>
Напевает "input радостно звенят!"`,
    answer: `бубенцы`,
    prize: `Бубенцы, бубенцы радостно звенят!<br>
Звон идёт во все концы, саночки летят!<br>
Веселись! Запевай! Встань-ка в хоровод!<br>
Праздник к нам приходит, праздник новый год!`,
  },
  { 
    riddle: `У всех бывает отпуск, сладкая пора<br>
Можно не работать и даже отдохнуть<br>
Горестно вздыхает в школе детвора<br>
Перерыв в учёбе есть когда-нибудь?`,
    answer: `каникулы`,
    prize: `Позабыты хлопоты, выкинут рюкзак<br>
Позади дивана пылится пиджак<br>
Средь игрушек высится цитадель из книг<br>
Спит, блаженно щурится, утром ученик...`,
  },
  { 
    riddle: `Древние китайцы что-то понимали<br>
Каждый год и цветом, и животным нарекли<br>
Будет двадцать пятый годом деревянной<br>
И как листва на дереве зелёной input`,
    answer: `змеи`,
    prize: `Много не сказать о змее хорошего<br>
Говорят, рептилии стали всех умней<br>
Может быть, мудрее змеи были в прошлом<br>
Новый год пусть мудростью осенит людей`,
  },
  { 
    riddle: `Этот крендель как будто из Франции<br>
Гордо стоит на столе, как месье.<br>
Был бы человеком - удивил бы танцами<br>
Ну а так порадует вкусом input`,
    answer: `оливье`,
    prize: `Выпивай да ешь, не забывай про песни<br>
Новогодний стол ломится от блюд<br>
Кто здесь блюдо главное - всем давно известно<br>
Надо теперь выяснить, что вкуснее пьют!`,
  },
  { 
    riddle: `Сегодня задание будет сложнее<br>
Но ты напрягись, и тогда волшебство<br>
Явится миру. Готова? Проверим!<br>
Как по-английски сказать "рождество"?`,
    answer: `christmas`,
    prize: `Бинго! Тобою маэстро доволен<br>
Запросто взяла овраги и рвы<br>
Видно, не зря на своём телефоне<br>
Брала задания зелёной совы`,
  },
  { 
    riddle: `Чем бы заняться вечером зимним?<br>
Чай надоел, не хочу пирожки<br>
Может покинем стены квартиры<br>
Выйдем во двор, поиграем в input?`,
    answer: `снежки`,
    prize: `Хватаем детей и бегом одеваться<br>
Шапку надень, пальтецо натяни<br>
Лепим снежки неодетыми пальцами<br>
Но страшно не это - лицо береги!`,
  },
  { 
    riddle: `Итак, мы решили украсить квартиру<br>
Игрушек на ёлку повесили сто<br>
Снежинки на окна, на стены, на двери...<br>
Так, кажется, что-то забыли... Но что?`,
    answer: `гирлянда`,
    prize: `Теперь коридор освещён синим светом<br>
И звёзды на окнах будут сиять<br>
Красивая ёлка мигает приветливо<br>
Найти бы желание позже всё снять`,
  },
  { 
    riddle: `Карусели крутятся, лампочки мигают<br>
Сладких леденцов полные прилавки<br>
Лица у пришедших радостно сияют<br>
Не дойти до Санты через эту давку`,
    answer: `ярмарка`,
    prize: `Зазвенели бубенцы, заиграла музыка<br>
Заплясали вечером яркие огни<br>
Распустился фейерверк красочным пузыриком<br>
Разогналась карусель - попробуй догони!`,
  },
  { 
    riddle: `Снег захрустел под полозьями и заскрипели сани<br>
Лёгким дымком заструился пар изо рта<br>
Рот пошире открывай на этот сладкий input<br>
Чашка в замёрзших руках - это просто мечта!`,
    answer: `пряник`,
    prize: `Тёплым потоком наполнится тело от чая<br>
Сладким комочком растает твой пряник во рту<br>
Больше не страшно, пускай на дворе холодет<br>
Знаешь теперь, чем согреться тебе поутру`,
  },
  { 
    riddle: `Вот чудесная картинка<br>
Дом стоит и ёлка рядом<br>
А теперь тот дом встряхни-ка<br>
Тут же вьюга налетает`,
    answer: `снежный шар`,
    prize: `Та забавная вещица<br>
Улучшает настроение<br>
Пусть внутри снежок искриться<br>
А снаружи всем теплее`,
  },
  { 
    riddle: `Все говорят - в новогоднюю ночь<br>
Могут сбываться мечты о достатке<br>
Дух рождества обещал нам помочь<br>
input для нас зажигает украдкой`,
    answer: `свечи`,
    prize: `Радует слух треск горящих свечей<br>
Держимся мы в этот вечер за руки<br>
Я бесконечно влюблён в свет очей<br>
Я бы до смерти смотрел друг на друга`,
  },
  { 
    riddle: `Разве можно заскучать - каждый день так весел<br>
То уборка, то нытье - хоть ты застрелись<br>
Добавляют нам хлопот эти два балбеса<br>
Так когда же мы успели столько нагрешить?`,
    answer: `дети`,
    prize: `Где-то в жизни прежней были мы свободны<br>
Каждый делал что хотел, кем угодно был<br>
А теперь у нас есть дети, до любви голодные<br>
И ты теперь не человек, а фабрика любви`,
  },
  { 
    riddle: `Люди в целом существа, ну, недальновидные<br>
Каждый день поесть, поспать, а дальше - пустота<br>
Чтобы двигаться вперёд, надо быть продвинутым<br>
На день завтрашний смотреть. В чём твоя input?`,
    answer: `мечта`,
    prize: `Я мечтаю, чтоб с утра, как глаза откроются<br>
Знать, что рядом та, что мне не даёт упасть<br>
Делать всё, что нужно мне, не боясь банкротства<br>
Просто жить, без опасений что-то потерять`,
  },
  { 
    riddle: `Привет тебе, наш тёплый друг, а иногда горячий<br>
Тебе хвалу мы вознесём от души от всей<br>
Всё же мы зимой хотим, чтоб ты светило ярче<br>
Жарким летом - чтобы ты скрылось побыстрей`,
    answer: `солнце`,
    prize: `Прожили мы ползимы, устали мы от холода<br>
Забыли песни певчих птиц - усладу для ушей<br>
Мы требуем ещё тепла, без шапок чтобы головы<br>
Вот только новый год пройдёт, а там - давай скорей!`,
  },
  { 
    riddle: `Мы на ель повесили яркие input<br>
Комнату украсили гирляндами огней<br>
Напекли на праздник сладкие ватрушки<br>
Чтобы новый год встречать было веселей`,
    answer: `игрушки`,
    prize: `Мы уже не дети, чтоб играть с машинками<br>
Куклы, динозавры нас не веселят<br>
Мы с тобой друг другу стали отдушиною<br>
Я хочу тебя пройти много раз подряд`,
  },
  { 
    riddle: `Занятную историю нам рассказал писатель<br>
Паренёк со шрамом рос с неродной семьёй<br>
Злой главгад его искал, без носа и в халате<br>
А мораль - следите лучше за своей змеёй`,
    answer: `гарри поттер`,
    prize: `Даже фильмы про него хорошо снимались<br>
Я схожу, возьму пивка, приготовь нам снедь<br>
Восемь дней до нового года нам осталось<br>
Может, следующий фильм надо посмотреть?`,
  },
  { 
    riddle: `У подростков есть игра - правда или действие<br>
В этот раз решаю я, и я буду смотреть.<br>
Мужу дай свой телефон, он введёт ответ туда<br>
Твоя задача - станцевать, или песню спеть!`,
    answer: `дело сделано`,
    prize: `В общем, эта часть стиха создана заранее<br>
И за что тебя хвалить - знать я не могу<br>
Я могу сказать одно - в целом, одинаково<br>
я и тело, и мозги у тебя люблю`,
  },
  { 
    riddle: `Есть пельмени со сметаной и колбаски с ливером<br>
Есть салями колбаса, синий сыр дор блю<br>
Среди выпечки у нас кексы будут в лидерах<br>
Ну а я сильней всего input люблю!`,
    answer: `булочки`,
    prize: `Булочки румяные, и на ощупь мягкие<br>
Забываешь рядом с ними, как себя вести<br>
Утром хочу булочку, чтобы ей позавтракать<br>
К вечеру же хочется булочку схватить!`,
  },
  { 
    riddle: `Достань два бокала, любимая - тебе и мне<br>
Надеюсь, сегодня твоя голова не болит<br>
Сегодня мы в поисках истины. Где же? В вине!<br>
И я предлагаю бокалом input пить`,
    answer: `шампанское`,
    prize: `Вгляни сквозь бокал на свечу - видишь огни,<br>
Что пляшут тревожно средь пузырьков?<br>
И, как пузырьки рассыпаются в искрах они<br>
Так пусть рассыпается смехом наша любовь`,
  },
  { 
    riddle: `Пусть бегут лошадки, ускоряя бег<br>
Пусть сливается толпа в праздничный кисель<br>
От забот, от тоски, от дневных проблем<br>
Унесёт, закружит, скачет input`,
    answer: `карусель`,
    prize: `С новым оборотом детство принесёт<br>
Можно руки отпустить, их раскинуть вверх<br>
Лучшее лекарство - не лимон и мёд<br>
Все проблемы лечит беззаботный смех`,
  },
  { 
    riddle: `Менять водой вино - то разве чудеса?<br>
Любые чудеса доступны в этот век<br>
Растёт вверху цветок, раздвинув небеса<br>
И падает на землю отживший input`,
    answer: `фейерверк`,
    prize: `Пусть краток его миг, но в этом миге - жизнь<br>
В попытке и луну, и солнышко затмить<br>
Пусть дальше темнота, пусть дальше - только вниз<br>
В глазах глядящих на него продолжит он светить`,
  },
  { 
    riddle: `Всего две буквы, а сколько в них души<br>
Нет, не души, а больше - двух душ<br>
Вместе живём, вместе ходим, вместе лежим<br>
Два человека, ты и я, жена и муж`,
    answer: `мы`,
    prize: `Цель в жизни должна быть всегда своя<br>
Нельзя эту цель у кого-нибудь взять взаймы<br>
Давай договоримся, и нашу цель ты и я<br>
Разделим друг с другом, и целью будем мы`,
  },
  { 
    riddle: `Придумано много разных существ<br>
Кикиморы, черти и бесы<br>
Кто ломает, кто строит, кто ест<br>
А есть такие как мы - input`,
    answer: `балбесы`,
    prize: `В миру хватает серьёзных дел<br>
Реальность становится зыбкой<br>
Надо, чтоб рядом был нужный чел:<br>
"Фигня! Разрулим с улыбкой!"`,
  },
  { 
    riddle: `Быстро промчится месяц последний<br>
Салат прошлогодний, завтрак похмельный<br>
Вспомнить число подсобит календарь<br>
Глянь - на дворе наступает input`,
    answer: `январь`,
    prize: `Снега за зиму увидишь немало<br>
Чистый, нетронутый символ начала<br>
Нового года разлёгся вокруг<br>
С месяцем новым, любимый мой друг!`,
  },
];

const placeholders = [
  'неправильно',
  'неа',
  'ну нет же',
  'не так',
  'серьёзно?',
  'попробуй ещё',
  'бред',
  'бе-бе-бе',
];

const storedDayIndex = localStorage.getItem('advent-2024');

const dayIndex = new Date().getDate() - 1;

const body = document.querySelector('body');
body.style.backgroundImage = `url('img/${dayIndex}.jpg')`;
body.style.backgroundSize = 'cover';
body.style.backgroundRepeat = 'no-repeat';
body.style.backgroundPosition = 'center';

const main = document.getElementById('main');

const riddle = document.createElement('div');
riddle.classList.add('riddle');
riddle.innerHTML = content[dayIndex].riddle;

let input = document.createElement('input');
input.classList.add('answer');

const prize = document.createElement('div');
prize.classList.add('prize');
prize.innerHTML = content[dayIndex].prize;

main.append(riddle);
const isInnerInput = riddle.innerHTML.includes('input');
if (isInnerInput) {
  riddle.innerHTML = riddle.innerHTML.replace('input', input.outerHTML);
  input = main.querySelector('.answer');
  input.style.display = 'inline';
  input.style.width = `${content[dayIndex].answer.length}ch`;
} else {
  main.append(input);
}
input.autofocus = true;
input.focus();
if (storedDayIndex >= dayIndex) {
  if (isInnerInput) {
    riddle.innerHTML = riddle.innerHTML.replace(input.outerHTML, content[dayIndex].answer);
  } else {
    main.removeChild(input);
  }
  main.append(prize);
} else {
  input.addEventListener('keypress', (event) => {
    if (event.key === 'Enter') {
      if (input.value.toLowerCase().replace('ё', 'е') === content[dayIndex].answer) {
        if (isInnerInput) {
          riddle.innerHTML = riddle.innerHTML.replace(input.outerHTML, content[dayIndex].answer);
        } else {
          main.removeChild(input);
        }
        main.append(prize);
        localStorage.setItem('advent-2024', dayIndex);
      } else {
        input.value = '';
        const placeholder = placeholders[Math.floor(Math.random() * placeholders.length)];
        input.style.width = `${placeholder.length}ch`;
        input.placeholder = placeholder;
        setTimeout(() => {
          input.placeholder = '';
          input.style.width = `${content[dayIndex].answer.length}ch`;
        }, 1000);
      }
    }
  });
}
